## 📋 OpenTofu Plan

**Environment:** `dev`
**Directory:** `./environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.azurerm_management_group.tenant_root: Reading...
data.azurerm_management_group.tenant_root: Read complete after 0s [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e]
module.drive_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01]
module.sandbox_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-sandbox-dev-glb-01]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group_policy_assignment.drive_deny_delete will be created
  + resource "azurerm_management_group_policy_assignment" "drive_deny_delete" {
      + description          = "Prevents deletion of any resources under drive management group"
      + display_name         = "Deny Delete - Drive"
      + enforce              = true
      + id                   = (known after apply)
      + management_group_id  = "/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01"
      + metadata             = (known after apply)
      + name                 = "deny-del-drive"
      + policy_definition_id = (known after apply)
    }

  # module.management_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "management"
      + id                         = (known after apply)
      + name                       = "mg-management-prd-glb-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.management_subscription_association.azurerm_management_group_subscription_association.this will be created
  + resource "azurerm_management_group_subscription_association" "this" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c"
    }

  # module.policy_deny_delete.azurerm_policy_definition.deny_delete will be created
  + resource "azurerm_policy_definition" "deny_delete" {
      + description         = "This policy denies all delete operations on resources for maximum protection."
      + display_name        = "Deny Delete Operations - Deny Delete"
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + metadata            = jsonencode(
            {
              + category = "Protection"
              + version  = "1.0.0"
            }
        )
      + mode                = "All"
      + name                = "deny-delete-deny-delete"
      + policy_rule         = jsonencode(
            {
              + if   = {
                  + allOf = [
                      + {
                          + exists = "true"
                          + field  = "type"
                        },
                    ]
                }
              + then = {
                  + details = {
                      + actionNames = [
                          + "delete",
                        ]
                    }
                  + effect  = "denyAction"
                }
            }
        )
      + policy_type         = "Custom"
      + role_definition_ids = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + management_management_group         = {
      + display_name = "management"
      + id           = (known after apply)
      + name         = "mg-management-prd-glb-01"
    }
  + management_subscription_association = {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c"
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit 0a8b13d3000347af4309f26ccb63067826049618*